emacs/modes/irony-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>irony-mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">irony-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1d37fc5">1. 概述</a></li>
<li><a href="#orga80f1d4">2. 安装</a>
<ul>
<li><a href="#org3cb819a">2.1. 依赖</a></li>
</ul>
</li>
<li><a href="#org9779fac">3. 配置</a></li>
<li><a href="#org7359c44">4. 使用</a>
<ul>
<li><a href="#org4b3ead8">4.1. Compilation Database</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1d37fc5" class="outline-2">
<h2 id="org1d37fc5"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
irony-mode 是一个 Emacs minor-mode，旨在改进 C，C++和 Objective-C 语言的编辑体验。它通过组合使用 Emacs package 和 C++ 程序（irony-sever）来工作。
</p>

<p>
特性：
</p>
<ul class="org-ul">
<li><p>
代码补全。
</p>

<p>
通过 Emacs 内置的 completion-at-point-functions 配合 company-mode 的后端 company-irony 完成。
</p></li>

<li><p>
语法检查
</p>

<p>
使用 flycheck 的检查器：flycheck-irony
</p></li>

<li>集成 eldoc：irony-doc</li>

<li>集成 counsel: <a href="https://oremacs.com/2017/03/28/emacs-cpp-ide/">https://oremacs.com/2017/03/28/emacs-cpp-ide/</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga80f1d4" class="outline-2">
<h2 id="orga80f1d4"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3cb819a" class="outline-3">
<h3 id="org3cb819a"><span class="section-number-3">2.1</span> 依赖</h3>
<div class="outline-text-3" id="text-2-1">
<p>
参见 <a href="https://github.com/Sarcasm/irony-mode#dependencies">Dependencies</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org9779fac" class="outline-2">
<h2 id="org9779fac"><span class="section-number-2">3</span> 配置</h2>
</div>

<div id="outline-container-org7359c44" class="outline-2">
<h2 id="org7359c44"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
<p>
首次运行时, irony-mode 会要求编译安装 irony-server。输入 <code>M-x irony-install-server RET</code> 完成安装。
</p>

<p>
为了提供符合上下文和准确的信息，irony-mode 需要知道用于解析当前缓冲区的编译器标志。 达到此目的的最佳方法是使用编译数据库。
</p>
</div>

<div id="outline-container-org4b3ead8" class="outline-3">
<h3 id="org4b3ead8"><span class="section-number-3">4.1</span> Compilation Database</h3>
<div class="outline-text-3" id="text-4-1">
<p>
为了正确工作，irony-mode 需要知道编译标志。irony-cdb 在用户输入最少的情况下尽可能自动的发现编译标志。
</p>

<p>
请参考 irony-cdb-autosetup-compile-options 和 irony-cdb-compilation-databases。
</p>

<p>
目前，irony-cdb 支持以下编译数据库：
</p>
<ul class="org-ul">
<li>JSON 编译数据库 - 由各种构建工具生成的 JSON 格式的文件。该文件名为 compile_commands.json，它列出了与项目中每个文件关联的编译选项。
<ul class="org-ul">
<li><p>
CMake&gt; = 2.8.5
</p>

<p>
使用
</p>
<div class="org-src-container">
<pre class="src src-sh">cmake -DCMAKE_EXPORT_COMPILE_COMMANDS = ON &lt;...&gt;
</pre>
</div>
<p>
在构建目录中生成生成编译数据库。
</p></li>

<li>ninja&gt; = 1.2 使用 compdb 工具生成 JSON 编译数据库。</li>

<li><p>
Bear 通过 “监视” 项目的构建来生成 JSON 编译数据库文件。基于 make 的项目的典型用法是
</p>
<div class="org-src-container">
<pre class="src src-sh">bear - make -B
</pre>
</div></li>
</ul></li>

<li>.clang_complete - 位于项目根目录，该文件每行一个编译标志。这与插件 <code>Rip-Rip/clang_complete</code> 兼容。如果想自动生成 <code>.clang_complete</code> ，请查看 <code>cc_args.py</code> 文档。</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:33</p>
<p class="validation"></p>
</div>
</body>
</html>
